dot-org.org
#   -*- mode: org; fill-column: 60 -*-

#+TITLE: Orgmode  | Deerpig's Dot Emacs
#+AUTHOR: Brad Collins
#+EMAIL: brad@chenla.la
#+STARTUP: showall
#+TOC: headlines 4
#+PROPERTY: header-args :results silent  :tangle emacs-org.el
:PROPERTIES:
:CUSTOM_ID: 
:Name:      /home/deerpig/proj/deerpig/dot-emacs/dot-org.org
:Created:   2017-07-02T18:05@Prek Leap (11.642600N-104.919210W)
:ID:        ae1f7f9c-7ba3-4578-b8cf-d5dfaa437f53
:VER:       552265605.209064064
:GEO:       48P-491193-1287029-15
:BXID:      pig:VWU6-4004
:Class:     dotemacs
:Type:      literate-program
:Status:    wip
:Licence:   MIT/CC BY-SA 4.0
:END:

[[https://img.shields.io/badge/made%20by-Deerpig-999999.svg?style=flat-square]] 
[[https://img.shields.io/badge/class-dotemacs-0072B2.svg?style=flat-square]]
[[https://img.shields.io/badge/type-literate%20program-0072B2.svg?style=flat-square]]
[[https://img.shields.io/badge/status-wip-D55E00.svg?style=flat-square]]
[[https://img.shields.io/badge/licence-MIT%2FCC%20BY--SA%204.0-000000.svg?style=flat-square]]

* Introduction

I try to keep all org mode related stuff here.  But org is
now so entwined with so many things in emacs that sometimes
it's difficult to know if it's an org package or, a dired,
or mu4e or whatever file that is provides some org
interoperability.

* Org Mode

** Org Plus Contrib
:PROPERTIES:
:ID:       0c2768ed-3257-4ff4-ab52-be45fd1fb1f9
:END:

I'm adding org-elpa here until I finalize moving from the old 
.emacs file.

Org Plus has all of the contrib packages that were found in the
contrib directory when installing org by hand.

#+begin_src emacs-lisp

(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
(use-package org-plus-contrib 
  :config)

#+end_src

** File Header
:PROPERTIES:
:ID:       c7112e5f-ac2d-41b0-9f48-2fdc2e665baa
:END:

#+begin_src emacs-lisp :results none
;; -*- mode: EMACS-LISP; fill-column: 75; comment-column: 50; -*-
;; Emacs Org Mode Configuration

#+end_src

** Load Orgmode
:PROPERTIES:
:ID:       ec7c1d90-def4-4171-a31e-f074de5fad31
:END:

At present we're running a local copy of Org, we will move over to the
MELPA version soon....

Set location for org-mode:

#+begin_src emacs-lisp
(add-to-list 'load-path "~/emacs-lisp/org-mode/lisp")
(add-to-list 'load-path "~/emacs-lisp/org-mode/contrib/lisp" t)

#+end_src

Load org mode

#+begin_src emacs-lisp
(require 'org)
#+end_src
** Enable Modules
:PROPERTIES:
:ID:       98775cfc-0192-4b2a-82e4-b6e8d9453019
:END:

We need to go through this list and weed out unused or obsolete
modules.

#+begin_src emacs-lisp
(setq org-modules 
       (quote (org-bbdb org-bibtex org-crypt org-gnus org-id org-info org-bullets org-habit org-inlinetask org-irc org-mew org-mhe org-protocol org-rmail org-vm org-wl org-w3m)))

#+end_src


** Babel Language Evaluation
:PROPERTIES:
:ID:       443b3051-dda7-479b-92f4-bf6d662b5987
:END:

#+begin_src emacs-lisp
;; Enable language evulation in Org Babel

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (ditaa .t)
   (dot . t)
   (R . t)
   (shell . t)
   (python . t)
   (ruby . t)
   (lisp  . t)
   (scheme . t)
   (calc . t)
   (plantuml . t)
   ))

(setq org-confirm-babel-evaluate nil)

(add-to-list 'org-src-lang-modes (quote ("dot" . graphviz-dot)))

#+end_src

** LaTex Syntax Higlighting
:PROPERTIES:
:ID:       e55958a2-85cc-435d-a179-8d60eb0e78e2
:END:

- [[http://pragmaticemacs.com/emacs/highlight-latex-text-in-org-mode/][Highlight latex text in org mode]] | Pragmatic Emacs

#+begin_src emacs-lisp
;;; Highlight LaTex code in org files ----------------------

(setq org-highlight-latex-and-related '(latex))
#+end_src


** Org Bullets
:PROPERTIES:
:ID:       289289b2-7dde-4ef6-affe-c8793abac407
:END:

Use Org Bullets with some funky unicode bullets:

Change the default bullet list and ellipsis. See:

   - [[https://www.miskatonic.org/2017/01/09/recent-emacs-changes/][Recent Emacs changes]] | Miskatonic University Press]]
   - [[http://endlessparentheses.com/changing-the-org-mode-ellipsis.html][Changing the org-mode ellipsis]] | Endless Parentheses

#+begin_example
    (setq org-bullets-bullet-list '("◉" "○ ""►" "•" "•"))
    (setq org-bullets-bullet-list '("⊢" "⋮" "⦚" "⦙" "⦀")) ;; ⦚ ⦀ ⦙ ⋱ 
    (setq org-ellipsis " ⤵") ;; ⤵ ↴ ⬎ ⤷
#+end_example

#+begin_src emacs-lisp
;; Org Bullets ---------------------------------------------

(use-package org-bullets
   :ensure t
   :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

    ;; Change bullet list
    ;; https://www.miskatonic.org/2017/01/09/recent-emacs-changes/
    ;; (setq org-bullets-bullet-list '("◉" "○ ""►" "•" "•"))
    (setq org-bullets-bullet-list '("⊢" "⋮" "⦚" "⦙" "⦀")) ;; ⦚ ⦀ ⦙ ⋱ 

    ;; Change the ellipsis that indicates hidden content
    ;; http://endlessparentheses.com/changing-the-org-mode-ellipsis.html
    (set-face-attribute 'org-ellipsis nil :underline nil)
    ;; ⤵ ↴ ⬎ ⤷
    (setq org-ellipsis " ⤵"))
#+end_src

** Key Bindings
:PROPERTIES:
:ID:       d15d339d-14b2-4da0-ad26-3d4d79f57894
:END:

#+begin_src emacs-lisp
(define-key global-map "\M-\C-r" 'org-capture)
(define-key global-map "\C-ca" 'org-agenda)

#+end_src

** Open Agenda Other Window
:PROPERTIES:
:ID:       10a6895c-eaeb-48b1-9c3e-1ba7c8f513e1
:END:

#+begin_src emacs-lisp

;; Open Agenda in Other Window -----------------------------
;; Options:
;;    reorganize-frame   :: show two windows in current frame
;;    current-window     :: use existing window
;;    only-window        :: delete other windows
;;    other-frame        :: open in other frame
(setq org-agenda-window-setup 'other-window)

#+end_src

** Org Speed Commands
:PROPERTIES:
:ID:       dfd55ab7-ca8f-46e9-91c8-0f246661f5f3
:END:

#+begin_src emacs-lisp
;; Org Speed Commands --------------------------------------
(setq org-use-speed-commands t)
(setq org-speed-commands-user (quote (("S" . widen))))

#+end_src

** Helm Org
:PROPERTIES:
:ID:       02533d85-f289-4135-aa83-a861aebef72f
:END:

#+begin_src emacs-lisp
;; Helm Org ------------------------------------------------
(require 'helm-org)

;;(define-key global-map "" 'helm-org-agenda-files-headings)
;;(define-key helm-map (kbd "C-c C-t") 'helm-org-agenda-files-headings)
;;(define-key map (kbd "t")  'helm-org-agenda-files-headings)

#+end_src

** Store Links
:PROPERTIES:
:ID:       bc0721d0-8119-4504-b36f-d8b1c47cc2b7
:END:

This is not only useful in Org, I use this in mu4e buffers as well.

#+begin_src emacs-lisp
;; Store a link to window or heading at point
;; Can then be inserted using C-c M-l
(global-set-key "\C-c\M-s" 'org-store-link)

#+end_src

** Timestamps
:PROPERTIES:
:ID:       ee8fcd30-6d17-4a04-9025-64b47bcfce58
:END:

#+begin_src emacs-lisp
;; Toggle active/inactive timestamps
(global-set-key "\C-c\C-x=" 'org-toggle-timestamp-type)

#+end_src

** Human Readable Timestamp
:PROPERTIES:
:ID:       397c9d81-0db4-41ef-ac0f-85770a244236
:END:

Used in burr/org headers.

#+begin_src emacs-lisp
(setq human-readable-stamp (concat "@" user-work-location-name
	      " (" user-work-latitude
	      "-" user-work-longitude ")"))
#+end_src

** Set Directories
:PROPERTIES:
:ID:       820e7e4c-d87b-4279-ae14-38d7cddba32f
:END:

#+begin_src emacs-lisp
(setq org-directory "~/org"
      org-default-notes-file "~/org/refile.org"
      org-agenda-diary-file  "~/org/diary.org")

#+end_src

** Misc Settings
:PROPERTIES:
:ID:       bbd1fffe-983c-4c19-846a-1c871ba3697c
:END:

Set a bunch of variables:

#+begin_src emacs-lisp
(setq org-agenda-include-diary t
      org-enforce-todo-dependencies t
      org-cycle-separator-lines 0
      org-use-fast-todo-selection t
      org-treat-S-cursor-todo-selection-as-state-change nil
      org-startup-indented t
      ;; Show all future entries for repeating tasks
      org-agenda-repeating-timestamp-show-all nil
      ;; Show all agenda dates - even if they are empty
      org-agenda-show-all-dates nil
      ;; Start the weekly agenda on Monday
      org-agenda-start-on-weekday 1
      ;; Show one week in weekly agenda view
      org-agenda-span 8
      org-deadline-warning-days 30
      org-src-fontify-natively 't
      ;; Display tags farther right
      org-agenda-tags-column -102)

#+end_src

** Org Weather
:PROPERTIES:
:ID:       48ec20b7-9b34-4d1b-83a4-a8a7e213744a
:END:

#+begin_src emacs-lisp

  ;; org-weather ===============================================
  ;; not on MELPA so we install the old fashioned way...
  ;; :home: https://github.com/kautsig/org-weather
  ;; :data: http://openweathermap.org/

  (add-to-list 'load-path "~/.emacs.d/org-weather")
  (require 'org-weather)
  ;; Set your location and refresh the data
  (setq org-weather-location "Phnom Penh, Cambodia"
	org-weather-api-key  "50bd25ab290db6c323c58439a8e6f41f"
	org-weather-format "天氣: %desc, %tmin-%tmax%tu, %h%hu")
  (org-weather-refresh)

#+end_src

** Function: Narrow/Widen Subtree

Not sure if I'm using this or now -- I can't recall using the
keybindings in some time -- I never can remember anything in emacs
using the Function Keys.

Commenting out for now....

#+begin_src emacs-lisp :tangle no
;; Narrow to subtree & widen
;;(global-set-key (kbd "<f5>") 'bh/org-todo)

;;(defun bh/org-todo ()
;;  (interactive)
;;  (org-narrow-to-subtree)
;;  (org-show-todo-tree nil))

;;(global-set-key (kbd "<S-f5>") 'bh/widen)

;;(defun bh/widen ()
;;  (interactive)
;;  (widen)
  ;;(org-reveal)
;;  )

#+end_src

** Refile Targets
:PROPERTIES:
:ID:       576ccf88-a629-4401-9a7f-b1e685e7c77c
:END:

If you include 'org-agenda-files' it will pull up refile
targets from your org-agenda refile file list.  I used this
for a while but it was too messy.  I've gone back to
specifically listing all files I want to use as targets.


#+begin_src emacs-lisp
;; Refile Targets ------------------------------------------
;;; Use agenda files as primary refile targets

(defun deerpig/org-buffer-files ()
  "Return list of opened orgmode buffer files"
  (mapcar (function buffer-file-name)
	  (org-buffer-list 'files)))

(setq org-refile-targets
'(
("~/org/notes.org"   :maxlevel . 1)
("~/org/quotes.org"  :maxlevel . 1)
("~/org/todo.org"    :maxlevel . 1)
("~/org/pnca.org"    :maxlevel . 1)
("~/org/repozit.org" :maxlevel . 1)
("~/org/chenla.org"  :maxlevel . 1)
("~/org/farm.org"    :maxlevel . 1)
("~/org/blog.org"    :maxlevel . 1)
;;(deerpig/org-buffer-files :maxlevel . 1)
;;(org-agenda-files . (:maxlevel . 1))
))

;; Set this if you want to use helm to choose refile-targets
(setq org-outline-path-complete-in-steps nil)
(setq org-completion-use-ido nil)

#+end_src

** Org-mode in message buffers

This sounded like a good idea, but in practice is got in the way more
than it helped.

Commented out.

#+begin_src emacs-lisp :tangle no
;; enable org-mode in message buffers
;; (setq message-mode-hook
;;       (quote (orgstruct++-mode
;;               (lambda nil (setq fill-column 72))
;;               turn-on-auto-fill
;;               bbdb-define-all-aliases)))

#+end_src

