dot-org.org
** Habits
:PROPERTIES:
:ID:       e0b9e6d4-e064-405d-a6b5-b6cda401e858
:END:


#+begin_src emacs-lisp
;; Enable habit tracking (and a bunch of other modules)

(require 'org-habit)
(setq org-habit-show-habits-only-for-today t)
(setq org-habit-show-all-today t)
; global STYLE property values for completion
(setq org-global-properties (quote (("STYLE_ALL" . "habit"))))
; position the habit graph on the agenda to the right of the default
(setq org-habit-graph-column 50)

#+end_src

** Display Images
:PROPERTIES:
:ID:       50cbb6ab-7f2e-4c44-a08a-ab947bd1b49d
:END:

#+begin_src emacs-lisp

;; Display images in org mode ------------------------------

(iimage-mode)
;;add the org file link format to the iimage mode regex
(add-to-list 'iimage-mode-image-regex-alist
 (cons (concat "\\[\\[file:\\(~?" iimage-mode-image-filename-regex "\\)\\]")  1))
;; add a hook so we can display images on load
(add-hook 'org-mode-hook '(lambda () (org-turn-on-iimage-in-org)))

;;function to setup images for display on load
(defun org-turn-on-iimage-in-org ()
  "display images in your org file"
  (interactive)
  (turn-on-iimage-mode)
  (set-face-underline-p 'org-link nil))

;;function to toggle images in a org bugger
(defun org-toggle-iimage-in-org ()
  "display images in your org file"
  (interactive)
  (if (face-underline-p 'org-link)
      (set-face-underline-p 'org-link nil)
      (set-face-underline-p 'org-link t))
  (call-interactively 'iimage-mode))

#+end_src

** Org Tag List
:PROPERTIES:
:ID:       0d70332e-4f98-4c4f-994f-644590849b30
:END:

#+begin_src emacs-lisp
(setq org-tag-alist (quote (
			    ("@errand" . ?e)
			    ("@blog"   . ?b)
			    ("@work"   . ?w)
			    ("@home"   . ?h)
                        ("@farm"   . ?f)
                        ("@campus" . ?c)
			    ("@road"   . ?r)
			    ("@call"   . ?c)
			    ("@email"  . ?m)
			      )))
#+end_src

** Org Easy Templates
:PROPERTIES:
:ID:       25244288-9a50-4f34-9530-387945bb9eb1
:END:

There is a bug in org-reveal that only allows upper case NOTES.  make
Notes upper case until there is a fix.

#+begin_src emacs-lisp

;; Easy Templates ==========================================

(add-to-list 'org-structure-template-alist '("n" "#+BEGIN_NOTES\n?\n#+END_NOTES"))
(add-to-list 'org-structure-template-alist '("C" "#+begin_comment\n?\n#+end_comment"))
#+end_src

** Ignore Heading
:PROPERTIES:
:ID:       9c949477-fe5a-46d0-a065-2f0743b6dd1c
:END:

Use the tag :ignore: on a heading and org will export the content of a
subheading but not export the title!  Very cool!

#+begin_src emacs-lisp
;; use the tag :ignore: on a heading and org will export the content
;; of a subheading but not export the title!  Very cool!

(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))

#+end_src

** Single Tags
:PROPERTIES:
:ID:       a2ffe3cb-2c48-47bb-a605-f0209a9a6ad6
:END:

Allow setting single tags without the menu

#+begin_src emacs-lisp
  ; Allow setting single tags without the menu
  (setq org-fast-tag-selection-single-key (quote expert))
    
  ; For tag searches ignore tasks with scheduled and deadline dates
  (setq org-agenda-tags-todo-honor-ignore-options t)

#+end_src


** Markdown export
:PROPERTIES:
:ID:       0ce5345d-5ac1-4a1a-8cd1-7f9c07d591b0
:END:

#+begin_src emacs-lisp
(require 'ox-md)
#+end_src

** EPUB export
:PROPERTIES:
:ID:       6f10d495-def1-468c-b814-82376faf51dc
:END:

#+begin_src emacs-lisp
  ;; (use-package ox-epub
  ;;   :ensure t
  ;;   :config
  ;; )
#+end_src


** Todo Keywords, Faces & Triggers
:PROPERTIES:
:ID:       2e830275-249a-4e90-80fa-24d164061bf1
:END:

Set Keywords:

#+begin_src emacs-lisp
(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(x)" "|" "WORK(w)" "DONE(d)")
              (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING" "DELEGATED")
	      (sequence "NOTES(n)" "QUOTE(q)" "EMAIL" "LINK")
	      )))

#+end_src

Set Faces for keywords:

#+begin_src emacs-lisp
(setq org-todo-keyword-faces
      '(("TODO"      :foreground "red"          :weight bold)
        ("NEXT"      :foreground "blue"         :weight bold) 
        ("DONE"      :foreground "green"        :weight bold)
	("NOTES"     . shadow)
	("DRAFT"     :foreground "purple"       :weight bold)
	("CANCELLED" :foreground "OrangeRed"    :weight bold)
	("MEETING"   :foreground "spring green" :weight bold)
	("PHONE"     :foreground "spring green" :weight bold)
	("DELEGATED" :foreground "spring green" :weight bold)
        ("QUOTE"     :foreground "yellow"       :weight bold)
        ("WORK"      :foreground "gold"         :weight bold)
	("LINK"      :foreground "tan2"         :weight bold)
       ;; ("EMAIL"     :foreground "maroon"       :weight bold)
	))

#+end_src

Triggers:

#+begin_src emacs-lisp
(setq org-todo-state-tags-triggers
      (quote (("CANCELLED" ("ARCHIVE" . t))
              ;;("DONE"      ("ARCHIVE" . t))
             	     )))

;; (setq org-todo-state-tags-triggers
;;       (quote (("CANCELLED" ("CANCELLED" . t))
;;               ("WAITING" ("WAITING" . t))
;;               ("HOLD" ("WAITING") ("HOLD" . t))
;;               (done ("WAITING") ("HOLD") ("DELEGATED"))
;;               ("TODO" ("WAITING") ("CANCELLED") ("HOLD"))
;;               ("NEXT" ("WAITING") ("CANCELLED") ("HOLD"))
;;               ("DONE" ("WAITING") ("CANCELLED") ("HOLD")))))

#+end_src

