dot-org.org
** Org Capture
:PROPERTIES:
:ID:       815f8576-f505-4fc0-8dca-d7ad59454bfa
:END:

#+begin_src emacs-lisp  :results silent  ;; results create nested drawers
;; Org Capture =============================================

;; I use C-c c to start capture mode
(global-set-key (kbd "C-c c") 'org-capture)

;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
;; http://orgmode.org/manual/Template-expansion.html#Template-expansion
(setq org-capture-templates
      (quote (("t" "TODO" entry (file "~/org/refile.org")
               "* TODO %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:REF:      %a\n:END:\n")
              ("n" "Note" entry (file "~/org/refile.org")
               "* NOTES %T %?\n:PROPERTIES:\n:CREATED: %T\n:ID:      %(org-id-new)\n:REF:     %a\n:END:\n")
	          ("q" "Quote" entry (file "~/org/refile.org")
               "* QUOTE \n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n\n#+begin_quote\n%?\n#+end_quote")
              ("j" "Journal" entry (file+datetree "~/org/diary.org")
               "* %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
              ("m" "Meeting" entry (file "~/org/refile.org")
               "* MEETING with %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
             ;;("p" "Phone call" entry (file "~/org/refile.org")
             ;;  "* PHONE %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
              ("p" "Protocol" entry (file+headline "~/org/refile.org")
               "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
              ("e" "Email" entry (file "~/org/refile.org")
               "* EMAIL %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n:url: %a\n") 
	          ("H" "Habit" entry (file "~/org/habits.org")
	           "** NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n")
              ("h" "Hoard" entry (file "~/proj/chenla/hoard/refile.org")
               "* BURR %?\n")
	         ;;("L" "Protocol Link" entry (file+headline  "~/org/refile.org")
             ;; "* %? [[%:link][%:description]] \nCaptured On: %U")
              ("l" "Link" entry (file "~/org/refile.org") ;; insert org link
	           "* LINK %?   %^g \n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
	          ("b" "BibTex" plain (file "~/org/ref.bib")
               "\n\n\n\n%?")
	          ("c" "Contacts" entry (file "~/org/contacts.org")
	           "* %?%:fromname\n:PROPERTIES:\n:ID:        %(org-id-new)\n:CREATED:   %T\n:NAME:      %:fromname\n:EMAIL:     %:fromaddress\n:PHONE:    \n:ALIAS:    \n:NICKNAME: \n:IGNORE:   \n:ICON:     \n:NOTE:     \n:ADDRESS:  \n:BIRTHDAY: \n:END:\n")
              ("B" "Chenla Blog" entry (file "~/org/blog.org")
               "** TODO %?\n%T\n"))))

             ;; ("p" "Phone call" entry (file "~/org/refile.org")
             ;;  "* PHONE %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
             ;;("l" "Link" entry (file "~/org/refile.org") ;; insert org link
	         ;; "* LINK %? %^C %^g \n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")


;;       ("B" "Blog Post" plain (file (capture-blog-post-file)) (file "tlp-blog-post.org"))
;;	      ("c" "Contacts" entry (file "~/org/contacts.org")
;;	       "* %(org-contacts-template-name)\n:PROPERTIES:\n:ID:        %(org-id-new)\n:CREATED:   %T\n:NAME:    %\1 %\1\n:EMAIL: %(org-contacts-template-email)\n:PHONE:    \n:ALIAS:    \n:NICKNAME: \n:IGNORE:   \n:ICON:     \n:NOTE:     \n:ADDRESS:  \n:BIRTHDAY: \n:END:\n")

#+end_src



- [[https://www.superloopy.io/articles/2017/blogging-with-org-mode.html][Blogging with Org mode]] | Superloopy

#+begin_src emacs-lisp
  ;;; Capture Blog Post --------------------------------------

  ;; (defun capture-blog-post-file ()
  ;;   (let* ((title (read-string "Post Title: "))
  ;;          (slug (replace-regexp-in-string "[^a-z]+" "-" (downcase title))))
  ;;     (expand-file-name
  ;;      (format "~/proj/sites/chenla.org/_posts/%s-%s.org"
  ;;              (format-time-string "%Y-%m-%d" (current-time))
  ;;              slug))))

#+end_src

** Open Capture in Other Frame
:PROPERTIES:
:ID:       781ee021-3048-4e35-a33f-e956f35c18d2
:END:

This has become a /very/ important part of my workflow.  I can now
open a capture window using =<win>-r= outside of emacs.  This is very
useful when adding references and contacts.  I've found that I am
using capture far more than I did when it opened in an existing frame,
though I still do that as well when I am in emacs.

See:

 - [[http://cestlaz.github.io/posts/using-emacs-24-capture-2/#.WKPa_NUxVpg][Org Capture 2]] | C'est la Z
 - [[https://github.com/nicferrier/emacs-noflet][nicferrier/emacs-noflet]] | github

#+begin_src emacs-lisp
;; Open Capture In Other Frame -----------------------------
;; In Openbox rc.xml bind:
;;    emacsclient -ne "(make-capture-frame)"
;; to W-r
;; 
;; See: http://cestlaz.github.io/posts/using-emacs-24-capture-2/

(defadvice org-capture-finalize 
    (after delete-capture-frame activate)  
  "Advise capture-finalize to close the frame"  
  (if (equal "capture" (frame-parameter nil 'name))  
    (delete-frame)))

(defadvice org-capture-destroy 
    (after delete-capture-frame activate)  
  "Advise capture-destroy to close the frame"  
  (if (equal "capture" (frame-parameter nil 'name))  
    (delete-frame)))

(use-package noflet
  :ensure t)

(defun make-capture-frame ()
  "Create a new frame and run org-capture."
  (interactive)
  (make-frame '((name . "capture")))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
    (org-capture)))

#+end_src

** Org Contacts
:PROPERTIES:
:ID:       ebf1862d-e23b-436e-8a5a-20f3f08aac05
:END:

Change to use-package?

#+begin_src emacs-lisp

;; Org Contacts ============================================

(require 'org-contacts)

#+end_src

** Open Agenda in Other Window
:PROPERTIES:
:ID:       4e7709e4-f65b-41c9-8f36-5c9a92d5f512
:END:

For years I opened agenda in a separate frame.  But when using a large
screen it's easier to work with if agenda opens in the frame on the left.

#+begin_src emacs-lisp
;; open agenda in other window
;; Options:
;;    reorganize-frame   :: show two windows in current frame
;;    current-window     :: use existing window
;;    only-window        :: delete other windows
;;    other-frame        :: open in other frame
(setq org-agenda-window-setup 'other-window)

#+end_src

** BibTex Mode
:PROPERTIES:
:ID:       10d18e3c-67eb-4cc3-8cb0-c680d80fe93e
:END:

Why is this in the emacs-org file?

#+begin_src emacs-lisp

;; BibTex Mode Stuff ---------------------------------------

(setq bibtex-autokey-year-length 4)

#+end_src

** Org Abbreviations
:PROPERTIES:
:ID:       49528295-f8a9-4714-bb29-30de45177b7d
:END:

This is very useful.  But I will have to revisit how I use them as we
start integrating BMF topicspaces into the config.

These are set globally, but they can be set for single files and
headings and headings as well.

#+begin_src emacs-lisp
;; Org Abbreviations ---------------------------------------

  (setq org-link-abbrev-alist
       '(("bug"  . "http://bugs.chenla.org/support/issue")
         ("gh"   . "https://github.com/")
         ;;("wiki" . "http://en.wikipedia.org/wiki/")
         ("rfc"  . "http://tools.ietf.org/html/")))

#+end_src

** Insert Epoch
:PROPERTIES:
:ID:       b10bfec0-6458-4d9b-8ce6-e17d35669e9a
:END:

This function will be used for setting version numbers in BMF.

#+begin_src emacs-lisp
(defun insert-epoch ()
  "Insert time in seconds from the J2000.0 epoch in
   sec.microseconds, by subtracting unix-time"
  (interactive)
  (insert (epoch-J2000)))


(defun epoch-J2000 ()
  "Get time in seconds from the J2000.0 epoch in
   sec.microseconds, by subtracting seconds unix-time
   until year 2000"
  (replace-regexp-in-string "\n\\'" "" 
			    (concat 
			     (number-to-string 
			      (round (- (string-to-number
					 (shell-command-to-string "date +%s")) 946727935)))
			     (shell-command-to-string "date +.%N"))))
#+end_src


