emacs-org.el

;; I use C-c c to start capture mode
(global-set-key (kbd "C-c c") 'org-capture)

;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
;; http://orgmode.org/manual/Template-expansion.html#Template-expansion
(setq org-capture-templates
      (quote (("t" "TODO" entry (file "~/org/refile.org")
               "* TODO %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:REF:      %a\n:END:\n")
              ("n" "Note" entry (file "~/org/refile.org")
               "* NOTES %T %?\n:PROPERTIES:\n:CREATED: %T\n:ID:      %(org-id-new)\n:REF:     %a\n:END:\n")
	          ("q" "Quote" entry (file "~/org/refile.org")
               "* QUOTE \n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n\n#+begin_quote\n%?\n#+end_quote")
              ("j" "Journal" entry (file+datetree "~/org/diary.org")
               "* %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
              ("m" "Meeting" entry (file "~/org/refile.org")
               "* MEETING with %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
              ("p" "Phone call" entry (file "~/org/refile.org")
               "* PHONE %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
              ("e" "Email" entry (file "~/org/refile.org")
               "* EMAIL %?\n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n") 
	          ("H" "Habit" entry (file "~/org/habits.org")
	           "** NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n")
              ("h" "Hoard" entry (file "~/proj/chenla/hoard/refile.org")
               "* BURR %?\n")
              ("h" "Hoard" entry (file "~/proj/chenla/hoard/refile.org")
               "* BURR %?\n")
              ("l" "Link" entry (file "~/org/refile.org") ;; insert org link
	           "* LINK %? %^C %^g \n:PROPERTIES:\n :CREATED: %T\n :ID:      %(org-id-new)\n:END:\n")
	          ("L" "Link" entry (file "~/org/refile.org") ;; create link
	           "* LINK %? %^L %^g \n:PROPERTIES:\n:CREATED:   %T\n:ID:       %(org-id-new)\n:END:\n")
	          ("b" "BibTex" plain (file "~/org/ref.bib")
               "\n\n\n\n%?")
	          ("c" "Contacts" entry (file "~/org/contacts.org")
	           "* %?%:fromname\n:PROPERTIES:\n:ID:        %(org-id-new)\n:CREATED:   %T\n:NAME:      %:fromname\n:EMAIL:     %:fromaddress\n:PHONE:    \n:ALIAS:    \n:NICKNAME: \n:IGNORE:   \n:ICON:     \n:NOTE:     \n:ADDRESS:  \n:BIRTHDAY: \n:END:\n"))))
;;	      ("c" "Contacts" entry (file "~/org/contacts.org")
;;	       "* %(org-contacts-template-name)\n:PROPERTIES:\n:ID:        %(org-id-new)\n:CREATED:   %T\n:NAME:    %\1 %\1\n:EMAIL: %(org-contacts-template-email)\n:PHONE:    \n:ALIAS:    \n:NICKNAME: \n:IGNORE:   \n:ICON:     \n:NOTE:     \n:ADDRESS:  \n:BIRTHDAY: \n:END:\n")

;; Open Capture In Other Frame -----------------------------
;; In Openbox rc.xml bind:
;;    emacsclient -ne "(make-capture-frame)"
;; to W-r
;; 
;; See: http://cestlaz.github.io/posts/using-emacs-24-capture-2/

(defadvice org-capture-finalize 
    (after delete-capture-frame activate)  
  "Advise capture-finalize to close the frame"  
  (if (equal "capture" (frame-parameter nil 'name))  
    (delete-frame)))

(defadvice org-capture-destroy 
    (after delete-capture-frame activate)  
  "Advise capture-destroy to close the frame"  
  (if (equal "capture" (frame-parameter nil 'name))  
    (delete-frame)))

(use-package noflet
  :ensure t)

(defun make-capture-frame ()
  "Create a new frame and run org-capture."
  (interactive)
  (make-frame '((name . "capture")))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
    (org-capture)))

;; Org Contacts ============================================

(require 'org-contacts)

;; open agenda in other window
;; Options:
;;    reorganize-frame   :: show two windows in current frame
;;    current-window     :: use existing window
;;    only-window        :: delete other windows
;;    other-frame        :: open in other frame
(setq org-agenda-window-setup 'other-window)

;; BibTex Mode Stuff ---------------------------------------

(setq bibtex-autokey-year-length 4)

;; Org Abbreviations ---------------------------------------

  (setq org-link-abbrev-alist
       '(("bug"  . "http://bugs.chenla.org/support/issue")
         ("gh"   . "https://github.com/")
         ;;("wiki" . "http://en.wikipedia.org/wiki/")
         ("rfc"  . "http://tools.ietf.org/html/")))

(defun insert-epoch ()
  "Insert time in seconds from the J2000.0 epoch in
   sec.microseconds, by subtracting unix-time"
  (interactive)
  (insert (epoch-J2000)))


(defun epoch-J2000 ()
  "Get time in seconds from the J2000.0 epoch in
   sec.microseconds, by subtracting seconds unix-time
   until year 2000"
  (replace-regexp-in-string "\n\\'" "" 
			    (concat 
			     (number-to-string 
			      (round (- (string-to-number
					 (shell-command-to-string "date +%s")) 946727935)))
			     (shell-command-to-string "date +.%N"))))
