dot-org.org
** Jekyll Projects
:PROPERTIES:
:ID:       4022e571-ed87-483f-a31e-5073c753836b
:END:

This section needs to be broken up and better documented.

#+begin_src emacs-lisp
;; Jekyll Projects =========================================

(setq deerpig-publish-blog-dir "")
(setq chenla-publish-blog-dir  "~/proj/sites/chenla.org/")


(setq org-html-htmlize-output-type 'css)


;; unset for localization
;;(setq org-jekyll-lang-subdirs '(("en" . "en/")))
;;(setq org-jekyll-lang-subdirs '(("kh" . "kh/")))

(require 'ox-publish)
(setq org-publish-project-alist
      (quote (("chenla-html"
	       :base-directory "~/proj/sites/chenla.org/"
	       :base-extension "org"
	       :publishing-directory  ,chenla-publish-blog-dir
	       :recursive t
	       :publishing-function org-html-publish-to-html
	       :headline-levels 4
           :table-of-contents nil
	       :html-extension "html")
       
	      ("chenla-static"
	       :base-directory "~/proj/sites/chenla.org/"
	       :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|svg"
	       :publishing-directory ,chenla-publish-blog-dir
	       :recursive t
	       :publishing-function org-publish-attachment)
       
	      ("chenla" :components ("chenla-html" "chenla-static"))


	      ("core-docs"
	       :base-directory "~/proj/chenla/core-docs/"
	       :base-extension "org"
	       :publishing-directory "~/proj/chenla/core-html/"
	       :recursive t
	       :publishing-function org-html-publish-to-html
	       :headline-levels 4
	       :html-extension "html")

	      
	      ("core-static"
	       :base-directory "~/proj/chenla/core-docs/"
	       :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|svg"
	       :publishing-directory "~/proj/chenla/core-html/"
	       :recursive t
	       :publishing-function org-publish-attachment)
       
	      ("core" :components ("core-docs" "core-static"))
	      )))

;; Deploy projects -----------------------------------------

(defun deploy (name)
  "Build and deploy local websites using shell script to call
   orgmode and git.  Scripts are kept in ~/.dotfiles/ and
   linked to ~/bin/"
  (interactive "cdeploy: (c)ore (l)a (d)eerpig")
  (shell-command     (cond ((equal name ?c) "cored")
			   ((equal name ?l) "betad")
			   ((equal name ?d) "deerd"))))

;; delete 2 blank spaces at top of files
;; when publishing

;; (add-hook 'org-publish-after-export-hook
;; 	  '(lambda nil
;; 	     (goto-char (point-min))
;; 	     (while (re-search-forward "^\n\n---" nil t)
;; 	       (replace-match "---"))
;;   ))

#+end_src

** Org-octopress
:PROPERTIES:
:ID:       e0e523ce-1836-4291-b9aa-514dc02add41
:END:

[[https://github.com/yoshinari-nomura/org-octopress][ - GitHub - yoshinari-nomura/org-octopress: org-mode in octopress]]

Required by org-subtree which uses ox-jekyll.el

#+begin_src emacs-lisp
(use-package org-octopress
  :ensure t)
#+end_src


** Export Subtree
:PROPERTIES:
:ID:       dc255eb6-d081-4f0c-b54c-37a943ea16f8
:END:

Code from:

  - [[https://github.com/Malabarba/ox-jekyll-subtree/blob/master/ox-jekyll-subtree.el][Malabarba/ox-jekyll-subtree]] | GitHub

#+begin_src emacs-lisp
;; Export for Jekyll subtrees ------------------------------


(load-file "~/.emacs.d/ox-jekyll-subtree.el")
;;(load-file "~/emacs-lisp/ox-jekyll.el")
(autoload 'endless/export-to-blog "jekyll-once")
(setq org-jekyll-use-src-plugin t)

(defun deerpig/set-blog-var ()
  "pull values for #+BLOGDIR and #+BASEURL and replace settings for 
   endless/blog-dir and endless/blog-base-url so that we can use 
   ox-jekyll-subtree for multiple blogs...."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (search-forward "#+BLOGDIR:")
    (forward-char 1)
    (setq endless/blog-dir
	  (buffer-substring-no-properties (point) (line-end-position)))
    (goto-char (point-min)) 
    (search-forward "#+BASEURL:")
    (forward-char 1)
    (setq endless/blog-base-url
	  (buffer-substring-no-properties (point) (line-end-position)))

    ))

;; Obviously, these two need to be changed for your blog.
(setq endless/blog-base-url "http://chenla.org/")
(setq endless/blog-dir (expand-file-name "~/proj/sites/chenla.org/"))
#+end_src

** Whitespace
:PROPERTIES:
:ID:       eb25fd1d-3e4d-4d9f-a786-3f94deeed7c6
:END:

Haven't used this in a while -- perhaps it should be put into a hydra?

#+begin_src emacs-lisp
(defun whack-whitespace (arg)
      "Delete all white space from point to the next word.  With prefix ARG
    delete across newlines as well.  The only danger in this is that you
    don't have to actually be at the end of a word to make it work.  It
    skips over to the next whitespace and then whacks it all to the next
    word."
      (interactive "P")
      (let ((regexp (if arg "[ \t\n]+" "[ \t]+")))
        (re-search-forward regexp nil t)
        (replace-match "" nil nil)))

#+end_src

** Org Man Page
:PROPERTIES:
:ID:       f9fde23d-ab1b-4ed1-8527-e5157e226b14
:END:

Does this work?

#+begin_src emacs-lisp
;; add man page url -----------------------------------------
(provide 'org-man)

#+end_src

** Org Word Count

While this is very cool, my mode line has far too much crap in it.
When I want to see a word count it's easy enough to run =wc= by hand.

Commented out.

#+begin_src emacs-lisp :tangle no

;; org word count ------------------------------------------

;;(add-hook 'org-mode-hook 'wc-mode)

#+end_src

** Org MIME

This code converts org markup into proper mime multipart
messages. This can be called in an org buffer or in a message buffer.

See:

  [[http://kitchingroup.cheme.cmu.edu/blog/2016/10/29/Sending-html-emails-from-org-mode-with-org-mime/][Sending html emails from org-mode with org-mime]]

------- put in code -----------


#+begin_src emacs-lisp :tangle no
;; org mime -------------------------------------
;; http://kitchingroup.cheme.cmu.edu/blog/2016/10/29/Sending-html-emails-from-org-mode-with-org-mime/
#+end_src

** Org IDs in Links
:PROPERTIES:
:ID:       71f43889-370f-4ae5-8cbb-a495f38c6c37
:END:

#+begin_src emacs-lisp  :results none ;; DON'T 
;; Use org-ids in org-links --------------------------------

(setq org-id-track-globally t)
(setq org-id-link-to-org-use-id t)
(org-id-update-id-locations) ;; updates id-index

#+end_src

** Function: Recursively Find org files
:PROPERTIES:
:ID:       032e4774-77b9-43b5-96db-9e6688dbf4a6
:END:

Recursively find .org files in provided directory.

Snarfed from:

  [[http://stackoverflow.com/questions/11384516/how-to-make-all-org-files-under-a-folder-added-in-agenda-list-automatically/11384907#11384907][How to make all org-files under a folder added in agenda-list automatically?]] Stack Overflow

#+begin_src emacs-lisp :results none
;; recursively find .org files in provided directory
;; modified from an Emacs Lisp Intro example
;;
;; Snarfed From: http://stackoverflow.com/a/11384907

(defun deerpig/find-org-file-recursively (&optional directory filext)
  "Return .org and .org_archive files recursively from DIRECTORY.
If FILEXT is provided, return files with extension FILEXT instead."
  (interactive "DDirectory: ")
  (let* (org-file-list
	 (case-fold-search t)	      ; filesystems are case sensitive
	 (file-name-regex "^[^.#].*") ; exclude dot, autosave, and backup files
	 (filext (or filext "org$\\\|org_archive"))
	 (fileregex (format "%s\\.\\(%s$\\)" file-name-regex filext))
	 (cur-dir-list (directory-files directory t file-name-regex)))
    ;; loop over directory listing
    (dolist (file-or-dir cur-dir-list org-file-list) ; returns org-file-list
      (cond
       ((file-regular-p file-or-dir) ; regular files
	(if (string-match fileregex file-or-dir) ; org files
	    (add-to-list 'org-file-list file-or-dir)))
       ((file-directory-p file-or-dir)
	(dolist (org-file (deerpig/find-org-file-recursively file-or-dir filext)
			  org-file-list) ; add files found to result
	  (add-to-list 'org-file-list org-file)))))))

#+end_src

** Search Extra Files
:PROPERTIES:
:ID:       8d6cad14-9c9d-420b-b759-30b33d6bbe3a
:END:

#+begin_src emacs-lisp

;; (setq org-agenda-text-search-extra-files
;;       '(agenda-archives
;;         "~/org/pinboard.org"
;;         "~/org/subdir/textfile1.txt"))

(setq org-agenda-text-search-extra-files
      (append (deerpig/find-org-file-recursively "~/org/" "org")
              (deerpig/find-org-file-recursively "~/proj/" "org")))


#+end_src


** Function: Add Org-Id to all headings in a file
:PROPERTIES:
:ID:       2bcc2ac4-0988-4d61-9e98-37a6e5ae3761
:END:

Snarfed this from:

  [[http://stackoverflow.com/questions/13340616/assign-ids-to-every-entry-in-org-mode][Assign IDs to every entry in Org-mode]] | Stack Overflow

I would eventually like be able to change the heading levels, so that
you can just add ids to level one or level two headings.

#+begin_src emacs-lisp
;; Add Org-ID to Headings in File --------------------------

(defun deerpig/org-add-id-to-headings ()
  "Insert and org-id to all headings in file at point that do not
have an id"
  (interactive)
   (require 'org-id)
   (save-excursion
      (goto-char (point-max))
      (while (outline-previous-heading)
        (org-id-get-create)))
  )

#+end_src

