emacs-org.el

;; Jekyll Projects =========================================

(setq deerpig-publish-blog-dir "")
(setq chenla-publish-blog-dir  "~/proj/chenla/build/chenla-html/")


(setq org-html-htmlize-output-type 'css)


;; unset for localization
;;(setq org-jekyll-lang-subdirs '(("en" . "en/")))
;;(setq org-jekyll-lang-subdirs '(("kh" . "kh/")))

(require 'ox-publish)
(setq org-publish-project-alist
      (quote (("chenla-html"
	       :base-directory "~/proj/chenla/chenla-org/"
	       :base-extension "org"
	       :publishing-directory  ,chenla-publish-blog-dir
	       :recursive t
	       :publishing-function org-html-publish-to-html
	       :headline-levels 4
           :table-of-contents nil
	       :html-extension "html")
       
	      ("chenla-static"
	       :base-directory "~/proj/chenla/chenla-org/"
	       :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|svg"
	       :publishing-directory ,chenla-publish-blog-dir
	       :recursive t
	       :publishing-function org-publish-attachment)
       
	      ("chenla" :components ("chenla-html" "chenla-static"))


	      ("core-docs"
	       :base-directory "~/proj/chenla/core-docs/"
	       :base-extension "org"
	       :publishing-directory "~/proj/chenla/core-html/"
	       :recursive t
	       :publishing-function org-html-publish-to-html
	       :headline-levels 4
	       :html-extension "html")

	      
	      ("core-static"
	       :base-directory "~/proj/chenla/core-docs/"
	       :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|svg"
	       :publishing-directory "~/proj/chenla/core-html/"
	       :recursive t
	       :publishing-function org-publish-attachment)
       
	      ("core" :components ("core-docs" "core-static"))
	      )))

;; Deploy projects -----------------------------------------

(defun deploy (name)
  "Build and deploy local websites using shell script to call
   orgmode and git.  Scripts are kept in ~/.dotfiles/ and
   linked to ~/bin/"
  (interactive "cdeploy: (c)ore (l)a (d)eerpig")
  (shell-command     (cond ((equal name ?c) "cored")
			   ((equal name ?l) "betad")
			   ((equal name ?d) "deerd"))))

;; delete 2 blank spaces at top of files
;; when publishing

;; (add-hook 'org-publish-after-export-hook
;; 	  '(lambda nil
;; 	     (goto-char (point-min))
;; 	     (while (re-search-forward "^\n\n---" nil t)
;; 	       (replace-match "---"))
;;   ))

(use-package org-octopress
  :ensure t)

;; Export for Jekyll subtrees ------------------------------


(load-file "~/emacs-lisp/ox-jekyll-subtree.el")
;;(load-file "~/emacs-lisp/ox-jekyll.el")
(autoload 'endless/export-to-blog "jekyll-once")
(setq org-jekyll-use-src-plugin t)

(defun deerpig/set-blog-var ()
  "pull values for #+BLOGDIR and #+BASEURL and replace settings for 
   endless/blog-dir and endless/blog-base-url so that we can use 
   ox-jekyll-subtree for multiple blogs...."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (search-forward "#+BLOGDIR:")
    (forward-char 1)
    (setq endless/blog-dir
	  (buffer-substring-no-properties (point) (line-end-position)))
    (goto-char (point-min)) 
    (search-forward "#+BASEURL:")
    (forward-char 1)
    (setq endless/blog-base-url
	  (buffer-substring-no-properties (point) (line-end-position)))

    ))

;; Obviously, these two need to be changed for your blog.
(setq endless/blog-base-url "http://chenla.org/")
(setq endless/blog-dir (expand-file-name "~/proj/chenla/chenla-org/"))

(defun whack-whitespace (arg)
      "Delete all white space from point to the next word.  With prefix ARG
    delete across newlines as well.  The only danger in this is that you
    don't have to actually be at the end of a word to make it work.  It
    skips over to the next whitespace and then whacks it all to the next
    word."
      (interactive "P")
      (let ((regexp (if arg "[ \t\n]+" "[ \t]+")))
        (re-search-forward regexp nil t)
        (replace-match "" nil nil)))

;; add man page url -----------------------------------------
(provide 'org-man)

;; Use org-ids in org-links --------------------------------

(setq org-id-track-globally t)
(setq org-id-link-to-org-use-id 'use-existing)
(org-id-update-id-locations) ;; updates id-index

;; recursively find .org files in provided directory
;; modified from an Emacs Lisp Intro example
;;
;; Snarfed From: http://stackoverflow.com/a/11384907

(defun deerpig/find-org-file-recursively (&optional directory filext)
  "Return .org and .org_archive files recursively from DIRECTORY.
If FILEXT is provided, return files with extension FILEXT instead."
  (interactive "DDirectory: ")
  (let* (org-file-list
	 (case-fold-search t)	      ; filesystems are case sensitive
	 (file-name-regex "^[^.#].*") ; exclude dot, autosave, and backup files
	 (filext (or filext "org$\\\|org_archive"))
	 (fileregex (format "%s\\.\\(%s$\\)" file-name-regex filext))
	 (cur-dir-list (directory-files directory t file-name-regex)))
    ;; loop over directory listing
    (dolist (file-or-dir cur-dir-list org-file-list) ; returns org-file-list
      (cond
       ((file-regular-p file-or-dir) ; regular files
	(if (string-match fileregex file-or-dir) ; org files
	    (add-to-list 'org-file-list file-or-dir)))
       ((file-directory-p file-or-dir)
	(dolist (org-file (deerpig/find-org-file-recursively file-or-dir filext)
			  org-file-list) ; add files found to result
	  (add-to-list 'org-file-list org-file)))))))

;; (setq org-agenda-text-search-extra-files
;;       '(agenda-archives
;;         "~/org/pinboard.org"
;;         "~/org/subdir/textfile1.txt"))

(setq org-agenda-text-search-extra-files
      (append (deerpig/find-org-file-recursively "~/org/" "org")
              (deerpig/find-org-file-recursively "~/proj/" "org")))

;; Add Org-ID to Headings in File --------------------------

(defun deerpig/org-add-id-to-headings ()
  "Insert and org-id to all headings in file at point that do not
have an id"
  (interactive)
   (require 'org-id)
   (save-excursion
      (goto-char (point-max))
      (while (outline-previous-heading)
        (org-id-get-create)))
  )

;; Org Reveal ==============================================
;;
