dot-org.org
** Insert Functions
:PROPERTIES:
:ID:       953ba5a3-2cb0-43df-94b5-b0bcb1434a9a
:END:

I'll be going through all of this and moving most into yasnippets or
sunsetting the ones I don't use.

#+begin_src emacs-lisp
;; ================================
;; Insert Fuctions
;; ================================


(defun insert-org ()
  "Insert template header in a org document"
  (interactive)
        (goto-char (point-min))
        (insert "#   -*- mode: org; fill-column: 60 -*-\n")
	(insert "#+TITLE: \n")
	(insert "#+AUTHOR: Brad Collins \\\<brad@chenla.la>\n")
	(insert "#+DATE: \n")
        (insert "#+STARTUP: showall\n")
      ;;(insert "#+FILETAGS: \n")
        (insert "#+INFOJS_OPT: view:info toc:t ltoc:t\n")
        (insert "#+HTML_HEAD_EXTRA: <style>body {margin-left:50px; width:60%;}</style>\n")
      ;;(insert "\n [ [[~/org/index.org][index]] | ]\n\n")
	(insert "  :PROPERTIES:")
        (insert "\n  :Name: ")
        (insert (format "%s" (buffer-file-name)))
        (insert "\n  :Created: ")
        (insert-iso)
        (insert "@")
        (insert user-work-location-name)
        (insert " (")
	(insert user-work-latitude)
	(insert "-")
	(insert user-work-longitude)
	(insert ")")
	(insert "\n  :ID: ")
	(insert (org-id-new))
	(insert "\n  :URL:")
	(insert "\n  :END:\n\n\n"))

(defun insert-latex ()
  "Insert latex header template in a org document at point."
  (interactive)
        (insert "#+OPTIONS: toc:nil H:5 todo:nil tasks:nil timestamp:nil\n")
        (insert "#+OPTIONS: \\n:nil email:nil d:nil skip:nil\n")
        (insert "#+LaTeX_CLASS_OPTIONS: [12pt,A4]\n")
        (insert "#+LaTeX_HEADER: \\usepackage[T1]{fontenc}\n")
        (insert "#+LaTeX_HEADER: \\usepackage{mathpazo}\n")
        (insert "#+LaTeX_HEADER: \\linespread{1.05}\n")
        (insert "#+LaTeX_HEADER: \\usepackage[scaled]{helvet}\n")
        (insert "#+LaTeX_HEADER: \\usepackage{courier}\n")
        (insert "#+LaTeX_Header: \\usepackage{parskip}\n")
        (insert "#+LaTeX_HEADER: \\usepackage{paralist}\n")
        (insert "#+LaTeX_HEADER: \\let\\itemize\\compactitem\n")
        (insert "#+LaTeX_HEADER: \\let\\description\\compactdesc\n")
        (insert "#+LaTeX_HEADER: \\let\\enumerate\\compactenum\n")
        (insert "#+LaTeX_HEADER: \\usepackage{lastpage}\n")
        (insert "#+LaTeX_HEADER: \\usepackage{fancyhdr}\n")
        (insert "#+LaTeX_HEADER: \\pagestyle{fancy}\n")
        (insert "#+LaTeX_HEADER: \\renewcommand{\\headrulewidth}{0pt}\n")
        (insert "#+LaTeX_HEADER: \\lhead{} \\chead{} \\rhead{}\n")
        (insert "#+LaTeX_HEADER: \\lfoot{ver:1.0 date}\n")
        (insert "#+LaTeX_HEADER: \\cfoot{title}\n")
        (insert "#+LaTeX_HEADER: \\rfoot{\\thepage\\ of \\pageref{LastPage}}\n")
        (insert "#+LaTeX: \\thispagestyle{fancy}\n")
        (insert "#+LATEX_HEADER: \\usepackage{hyperref}\n")
        (insert "#+LATEX_HEADER: \\hypersetup{\n")
        (insert "#+LATEX_HEADER:     colorlinks,%\n")
        (insert "#+LATEX_HEADER:     citecolor=black,%\n")
        (insert "#+LATEX_HEADER:     filecolor=black,%\n")
        (insert "#+LATEX_HEADER:     linkcolor=blue,%\n")
        (insert "#+LATEX_HEADER:     urlcolor=black\n")
        (insert "#+LATEX_HEADER: }\n"))

;; (defun insert-burr-org ()
;;   "Insert template header in a org Burr"
;;   (interactive)
;; 	(insert " :PROPERTIES:")
;;         (insert "\n :Name: ")
;; 	(insert "\n :Ver: ")
;; 	(insert-epoch)
;;         (insert " (J2000.0)")
;; 	(insert "\n :Type: ")
;;         (insert "\n :Created: ")
;;         (insert-iso)
;;         (insert "@")
;;         (insert user-work-location-name)
;;         (insert " (")
;; 	(insert user-work-latitude)
;; 	(insert "-")
;; 	(insert user-work-longitude)
;; 	(insert ")")
;; 	(insert "\n :ID: ")
;; 	(insert (org-id-new))
;; 	;;(insert "\n :REL:")
;; 	(insert "\n :END:\n\n\n")
;; 	)

;; (defun insert-tspace-org ()
;;   "Insert template topicspace header in a org document"
;;   (interactive)
;;         (goto-char (point-min))
;;         (insert " Topicspace  -*- mode: org; fill-column: 60 -*-\n")
;;         (insert "#+STARTUP: showall\n")
;; 	(insert "#+FILETAGS: BMF")
;;         (insert "\n [ [[~/org/index.org][index]] | ]\n\n")
;; 	(insert "  :PROPERTIES:")
;;         (insert "\n  :Name:  _(topicspace)")
;; 	(insert "\n  :Entity: topicspace")
;; 	(insert "\n  :Ver: ")
;; 	(insert-epoch)
;; 	(insert " (J2000.0)")
;;         (insert "\n  :Created: ")
;;         (insert-iso)
;;         (insert "@")
;;         (insert user-work-location-name)
;;         (insert " (")
;; 	(insert user-work-latitude)
;; 	(insert "-")
;; 	(insert user-work-longitude)
;; 	(insert ")")
;; 	(insert "\n  :ID: ")
;; 	(insert (org-id-new))
;; 	(insert "\n  :Path:")
;;         (insert (format "%s" (buffer-file-name)))
;; 	(insert "\n  :END:\n\n\n")
;;         (insert "* \n") 
;; 	)


(defun insert-moleskine ()
  "Insert template org-mode properties box for notes transcribed from my moleskine into an org note"
  (interactive)
       ;; (goto-char (point-min))
	(insert "  :PROPERTIES:")
	(insert "\n  :Comment: Transcribed from small moleskine")
        (insert "\n  :Created: ")
	(insert "\n  :ID: ")
	(insert (org-id-new))
	(insert "\n  :END:\n\n\n")
	)

(defun insert-uuid ()
  "Insert a UUID at point"
  ;; FIXME: problem is that you have to be in org
  ;;  mode to use this
  (interactive)
  (insert (org-id-new)))

(defun insert-filename-org ()
  "Insert a file-name comment at point.  Used to update older muse files"
  (interactive)
  (insert "; Name:  ")
  (insert (format "%s" (buffer-file-name)))
  )

(defun insert-blog ()
  "Insert template header in a blog post"
  (interactive)
        (goto-char (point-min))
        (insert "#+STARTUP: showall\n")
	(insert "#+STARTUP: hidestars\n")
        (insert "#+INFOJS_OPT: view:info toc:t ltoc:nil\n")
	(insert "#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:nil\n")
	(insert "#+BEGIN_HTML\n")
	(insert "---\n")
	(insert "layout: post\n")
	(insert "title : \"\"\n")
	(insert "topics: \n")
	(insert "style : blog\n")
	(insert "---\n")
	(insert "#+END_HTML\n\n\n"))

(defun insert-hex-bxid ()
  "Insert 4 slot hex BXID"
  (interactive)
  (insert "!")
  (insert-hex)
  (insert "!")
  (insert-hex)
  (insert "!")
  (insert-hex)
  (insert "!")
  (insert-hex))


(defun insert-burr ()
  "Insert template header for a new Burr"
  (interactive)

  (insert "* DRAFT \n")      
  (org-insert-time-stamp nil t t nil nil nil)
  (insert "\n\n:HEAD:\n")
  (insert ":bmf: bmfver:0.0,100_Canary\n")
  (insert ":id: [[bmf: /base/")
  (insert-epoch)
  (insert "\n")
  (insert ":entity-type: [[bmf:doc_(entity_type)]]\n")
  (insert ":bxid: bxid:")
  (insert-hex-bxid)
  (insert "\n")
  (insert ":layer: [[bmf:base_(layer_type)]]\n")
  (insert ":owner: [[agent:@deerpig]]\n")
  (insert ":created: stamp:")
  (insert-iso)
  (insert "@")
  (insert (princ user-work-latitude))
  (insert ";-")
  (insert (princ user-work-longitude))
  (insert "\n")
  (insert ":creator: [[agent:@deerpig]]\n")
  (insert ":version: ver:")
  (insert-epoch)
  (insert "\n")
  (insert ":END:\n")
  (insert ":TREE:\n")
  (insert ":tt: [[bmf:BMF_(topicspace)]]\n")
  (insert ":bt: [[\n")
  (insert ":pt: [[bmf:\n")
  (insert ":END:\n\n")
  (insert "** Scope Note\n")
  (insert "** References\n"))

  ;;(insert "** Scope Note\n")
  ;;(insert "=x= is a BMF element used in the =head= section.  The
  ;;         only allowed value is =x=.\n")
  ;;(insert "** Meta\n")
  ;;(insert ":module:       [[bmf:BMF_core]]\n")
  ;;(insert ":parent:       [[bmf:head_(section_type)]]\n")
  ;;(insert ":children:     not allowed\n")
  ;;(insert ":value:        \n")
  ;;(insert ":attributes:   not allowed\n")
  ;;(insert "** Usage\n")
  ;;(insert "*** XML Syntax\n")
  ;;(insert "#+begin_example\n\n")
  ;;(insert "#+end_example\n")
  ;;(insert "*** Wiki Syntax\n")
  ;;(insert "#+begin_example\n\n")
  ;;(insert "#+end_example\n")
  ;;(insert "** Schema\n")
  ;;(insert "** References\n"))

(global-set-key (kbd "<f9> b") 'insert-burr)


(defun insert-ideo ()
  "Insert ideograph character template at point"
  (interactive)
        ;;(goto-char (point-min))
        (insert ":Reading:   \n")
	(insert ":Cantonese: \n")
	(insert ":Pinyin:    \n")
	(insert ":UTF-8:     U+\n")
	(insert ":Grade:     \n")
	(insert ":Radical:   \n")
	(insert ":Stroke:    \n")
	(insert ":Frequency: \n\n\n")
	(insert ":Animated: \n")
	(insert ":Unihan:   \n")
	(insert ":Zongwhen: \n\n"))



#+end_src

