dot-org.org
** Org Width
:PROPERTIES:
:ID:       deaef821-2df1-4569-9c7a-e812dc18879a
:END:

Allow images width to be set in org buffers.

This only works if ImageMagick support is enabled when emacs is
enabled.

#+begin_src emacs-lisp

;; Org Width ===============================================
;; set image width in org buffers

(setq org-image-actual-width nil)
#+end_src
** Pomidor- [[https://github.com/TatriX/pomidor][TatriX/pomidor]] | GitHub
:PROPERTIES:
:ID:       bb1b5df0-32ba-4253-8474-cc9dabc596b7
:END:

Pomodomo timer.

Compile problems when installing from Melpa, so commenting
out for now.

#+begin_src emacs-lisp 

;; Pomodomo Timer ==========================================
;;(use-package pomidor
;;  :ensure t)
#+end_src

** A Better Return

 - [[http://kitchingroup.cheme.cmu.edu/blog/2017/04/09/A-better-return-in-org-mode/?utm_source=feedburner&utm_medium=twitter&utm_campaign=Feed:+TheKitchinResearchGroup+(The+Kitchin+Research+Group)][A better return in org-mode]]

#+begin_src emacs-lisp :tangle no

;; Org Return ==============================================
;;
(defun scimax/org-return ()
  "Add new list or headline "
  (interactive)
  (cond
   ((org-in-item-p)
    (if (org-element-property :contents-begin (org-element-context))
        (org-insert-heading)
      (beginning-of-line)
      (setf (buffer-substring
             (line-beginning-position) (line-end-position)) "")
      (org-return)))
   ((org-at-heading-p)
    (if (not (string= "" (org-element-property :title (org-element-context))))
        (progn (org-end-of-meta-data)
               (org-insert-heading))
      (beginning-of-line)
      (setf (buffer-substring
             (line-beginning-position) (line-end-position)) "")))
   ((org-at-table-p)
    (if (-any?
         (lambda (x) (not (string= "" x)))
         (nth
          (- (org-table-current-dline) 1)
          (org-table-to-lisp)))
        (org-return)
      ;; empty row
      (beginning-of-line)
      (setf (buffer-substring
             (line-beginning-position) (line-end-position)) "")
      (org-return)))
   (t
    (org-return))))

(define-key org-mode-map (kbd "RET")
  'scimax/org-return)
#+end_src

