emacs-org.el
;; set image width in org buffers

(setq org-image-actual-width nil)

;; Pomodomo Timer ==========================================
(use-package pomidor
  :ensure t)
